#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/renata-corporation/learning-aws-lambda-with-serverless/runs/run-4jMroJPxrAyudUF7

Waiting for the plan to start...

Terraform v1.3.2
on linux_amd64
Initializing plugins and modules...
aws_api_gateway_rest_api.MyDemoAPI: Refreshing state... [id=l9izdkmlve]
aws_api_gateway_resource.MyDemoResource: Refreshing state... [id=0jrp72]
aws_api_gateway_method.MyDemoMethod: Refreshing state... [id=agm-l9izdkmlve-0jrp72-GET]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.integration: Refreshing state... [id=agi-l9izdkmlve-0jrp72-GET]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_resource.MyDemoResource will be updated in-place
  ~ resource "aws_api_gateway_resource" "MyDemoResource" {
        id          = "0jrp72"
      ~ path_part   = "mydemoresource" -> "products"
        # (3 unchanged attributes hidden)
    }

  # aws_dynamodb_table.productsdb will be created
  + resource "aws_dynamodb_table" "productsdb" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "Products"
      + range_key        = "name"
      + read_capacity    = 20
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "dynamodb-table-products"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "dynamodb-table-products"
        }
      + write_capacity   = 20

      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "name"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = "TimeToExist"
          + enabled        = false
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```

</details>

*Pushed by: @renatabrasil, Action: `pull_request`*